; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v3 - type_1 ?v1 - type_2)
 	      (pred_3 ?v7 - object ?v1 - type_2)
	      (pred_1 ?v3 - type_1 ?v4 - type_3)
	      (pred_2 ?v3 - type_1 ?v7 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v3 - type_1 ?v8 ?v2 - type_2)
       :precondition (and  (pred_4 ?v3 ?v8))
       :effect (and  (pred_4 ?v3 ?v2)
		     (not (pred_4 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v6) (pred_4 ?v3 ?v6) (pred_1 ?v3 ?v4))
       :effect (and (pred_2 ?v3 ?v5 ?v4)
		    (not (pred_3 ?v5 ?v6)) 
		    (not (pred_1 ?v3 ?v4))))

   (:action op_2
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v5 ?v4) (pred_4 ?v3 ?v6))
       :effect (and (pred_3 ?v5 ?v6)
		    (pred_1 ?v3 ?v4)
		    (not (pred_2 ?v3 ?v5 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_01 - type_1
obj_09 obj_02 obj_12 obj_06 - type_3
obj_05 obj_04 obj_08 obj_03 - type_2
obj_11 obj_10 obj_13 - object)
(:init
(pred_4 obj_07 obj_03)
(pred_1 obj_07 obj_09)
(pred_1 obj_07 obj_02)
(pred_4 obj_01 obj_04)
(pred_1 obj_01 obj_12)
(pred_1 obj_01 obj_06)
(pred_3 obj_11 obj_08)
(pred_3 obj_10 obj_05)
(pred_3 obj_13 obj_08)
)
(:goal
(and
(pred_3 obj_11 obj_03)
(pred_3 obj_10 obj_05)
(pred_3 obj_13 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_07 obj_03) (pred_4 obj_01 obj_03))))
  )
)
)

; plan
1. (op_3 obj_07 obj_03 obj_08)
   deleted: (pred_4 obj_07 obj_03)
   added: (pred_4 obj_07 obj_08)
   goals met: 1 of 3
2. (op_3 obj_01 obj_04 obj_08)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_08)
   goals met: 1 of 3
3. (op_1 obj_07 obj_13 obj_08 obj_02)
   deleted: (pred_3 obj_13 obj_08) (pred_1 obj_07 obj_02)
   added: (pred_2 obj_07 obj_13 obj_02)
   goals met: 1 of 3
4. (op_1 obj_07 obj_11 obj_08 obj_09)
   deleted: (pred_3 obj_11 obj_08) (pred_1 obj_07 obj_09)
   added: (pred_2 obj_07 obj_11 obj_09)
   goals met: 1 of 3
5. (op_3 obj_07 obj_08 obj_03)
   deleted: (pred_4 obj_07 obj_08)
   added: (pred_4 obj_07 obj_03)
   goals met: 1 of 3
6. (op_2 obj_07 obj_13 obj_03 obj_02)
   deleted: (pred_2 obj_07 obj_13 obj_02)
   added: (pred_3 obj_13 obj_03) (pred_1 obj_07 obj_02)
   goals met: 2 of 3
7. (op_2 obj_07 obj_11 obj_03 obj_09)
   deleted: (pred_2 obj_07 obj_11 obj_09)
   added: (pred_3 obj_11 obj_03) (pred_1 obj_07 obj_09)
   goals met: 3 of 3
